app/controllers/api/v1/auth_controller.rb

   def create
     # see if there is a user with this username
     user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Vaporeon"], ["LIMIT", 1]]