app/controllers/api/v1/tickers_controller.rb

SELECT "tickers".* FROM "tickers"
---
  def index
    @tickers= Ticker.all